# location-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_processor_cusstomer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-location_processor_cusstomer_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 1s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:location_processor]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 1s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-09f3f36d-4eb7-4cbd-92a0-6cf27d288db1]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0-20230526044736018700000001]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0:lambda-secrets-policy-location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_processor_cusstomer_v1_event:lambda-secrets-policy-location_processor_cusstomer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_processor_cusstomer_v1_event-20230526044736111300000002]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-eb242819-37a2-4bda-95c8-95845e1d3f58]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 2s [id=33e36e069cfd28cf3aaf2fef0264fd363525ea68]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 3s [id=33e36e069cfd28cf3aaf2fef0264fd363525ea68]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=location_processor_cusstomer_v1_event]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=9d57295c-0e4b-4d5c-982d-e8590bdecc87]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=fda161fa-7d36-491d-9bac-8363cdced7ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "location_processor_cusstomer_v1_event"
      ~ last_modified                  = "2023-05-26T11:19:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvc7kYmDszJRQhrv+8t16PHFnMCqW4CEluvw5Fxuwuc=" -> "xfnXIPFUGbixVBDj3re3kDuEXq3nT1QXuEsWE5PhYgk="
        tags                           = {
            "domain"        = "location"
            "environment"   = "staging"
            "resource"      = "location-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "location_processor_cusstomer_v1_event_retry_0"
      ~ last_modified                  = "2023-05-26T11:19:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvc7kYmDszJRQhrv+8t16PHFnMCqW4CEluvw5Fxuwuc=" -> "xfnXIPFUGbixVBDj3re3kDuEXq3nT1QXuEsWE5PhYgk="
        tags                           = {
            "domain"        = "location"
            "environment"   = "staging"
            "resource"      = "location-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "location"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "location_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:location_processor"
        name       = "location_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "8a055584-6362-431e-8b0c-29469a65fc6c" -> "cde3ddcc-5016-4339-9fdf-afff45f83409"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*